package crossword_generator

type CrissCross27 struct{}

func (wp CrissCross27) GetWords() []*Word {
	strings := []string{
		"обоз",
		"орел",
		"сноб",
		"язва",
		"амбар",
		"аркан",
		"грамм",
		"канат",
		"киста",
		"кража",
		"ладан",
		"молва",
		"набор",
		"норма",
		"озноб",
		"олово",
		"редис",
		"скарб",
		"совет",
		"тапир",
		"алтарь",
		"аренда",
		"атеист",
		"галоши",
		"железо",
		"жилище",
		"запрет",
		"манера",
		"мнение",
		"начало",
		"осадки",
		"осмотр",
		"покров",
		"рвение",
		"романс",
		"телега",
		"агроном",
		"акробат",
		"вторник",
		"классик",
		"лебедка",
		"монолог",
		"педиатр",
		"рассада",
		"свобода",
		"соблазн",
		"таракан",
		"тромбон",
		"авиазавод",
		"гильотина",
		"коллектив",
		"остановка",
	}

	words := make([]*Word, 0)

	for _, aString := range strings {
		aWord := NewWord(aString)
		words = append(words, aWord)
	}

	return words
}
